SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-60047

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_A3_60047.s )
Size  ( 2.612571m 4.006094m 13.333120m )
Mass ( 96.25t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 30cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)

Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 264kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )
MaxReleaseRate ( 2.5inHg/s )
MaxApplicationRate ( 2.0inHg/s )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.84m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 7145 )
ORTSDavis_B ( 32.18 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
Light	(
			comment( Front Position B )
			Type ( 0 )
			Conditions (
			Headlight(4)Unit(2)
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( 1.0 1.42 6.15 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Front Position D )
			Type ( 0 )
			Conditions (
			Headlight(4)Unit(2)
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( -1.0 1.42 6.15 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.5 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)
	Inside (
        PassengerCabinFile ( DR_BR_A3_60047.s )
        PassengerCabinHeadPos ( 1.423 3.0 -5.25 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\A3Sound\\A3eng.sms" )
)

Engine ( OR-60047

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 4.1 -4.807
				0 1 0
				0.2
			)

			SafetyValvesFX
			(
				0 4.2 -4.319
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 4.2 -4.619
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.1 4.110
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.1 4.110
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.1 4.110
				0 1 0
				0.25
			)
			Injectors2FX
			(
				-1.1 0.9 -6.0
				0 -1 0
				0.16
			)
			Injectors1FX
			(
				1.1 0.9 -6.0
				0 -1 0
				0.16
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.075 0.467 4.787
				0 0 1
				0.3
			)

			CylindersFX
			(
				1.075 0.467 4.787
				0 0 1
				0.3
			)
		)
	)

Wagon ( OR-60047 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 66.3t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 356ft^3 )  
ORTSEvaporationArea ( 2692ft^2 )
ORTSSuperheatArea ( 703ft^2 )
MaxBoilerPressure ( 220psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 41.25ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

Comment( MEC Tenders define Water and Coal Mass )
MaxTenderCoalMass ( 8t-uk )
MaxTenderWaterMass ( 50000lb )

IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower( 2204hp )) 
Comment(ORTS Default Evaporation Rate of 15 Calculates 2204hp)
Comment(OR Calculates 1969hp at 13.35 Rate)

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )
Comment ( Upgraded Pressure Drop - Good Steamer)
ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  )

ORTSBoilerEfficiency( 0.0 0.98  140.0 0.49 )Comment(Good Steamer)

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( Vacuum_single_pipe )

Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )

Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 ))
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 ))
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 1 0 
                NumNotches( 6 
				Notch ( 0     	0 Dummy )
				Notch ( 0.25	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )
                   	Notch ( 2   	0 Dummy )
				)
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                		Notch ( 0     	0 Dummy )
                   	Notch ( 0.15   	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
				Notch ( 1		0 Dummy )
			)
		)
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            Headlights( 0 1 0 )
        )

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( TornadoA3.cvf )
HeadOut (  -1.423 3.0 -5.25 )
Sound ("..\\..\\Common.Steam\\A3Sound\\A3cab.sms" )
Name ( "60047 A3 Gresley, DONOVAN, New England Shed 35A, TE 32.9Klbf - Coal 8t, Water 5000gal" )
Description (
"In 1924, The Superheater Co. in New York, created plans for a new superheater design (Type E) which should have improved the steaming abilities of the A1s. After a series of tests, the improvements were found to be small and uneconomic. This surprisingly low improvement was explained by the fact that the original A1 superheaters used the standard Robinson design which concentrated the superheater tubes where they would be most effective. Hence the extra tube surface area in the new superheater, had to be in less effective areas of the boiler. 
After the Type E superheater failed to produce any significant results, Gresley decided to increase the number of flues in the Robinson superheater which was already in use in the A1s. At the same time, it was also decided to increase the boiler pressure from 180psi to 220psi. The first five of these new boilers were ordered in 1927. By the end of 1927 No. 2544 Lemberg and No. 4480 Enterprise had been rebuilt with the new boilers. Locomotives with the boiler rebuild were given the designation of Class A3. These were followed by three more rebuilds in 1928. The cylinder size was kept the same (20in), except for No. 2544 which had lined 18.25in cylinders so that the tractive effort would be similar to the A1s. This allowed comparative trials to be made. The trials were a success, and 27 A1s were rebuilt as A3s between 1928 and 1935. These rebuilds had slightly smaller cylinders of 19in, and the original five rebuilds were fitted with this new size. 
Due to the wider header on the A3 boilers, the ends projected slightly through the sides of the smokebox. Hence, cover plates were fitted to cover up these projections. These cover plates are the main external distinguishing feature between the A3s and the A1s. 
With the advent of the A3s, all new Pacifics were built to the A3 specification rather than the A1. Also, no new 180psi A1 boilers were built. Further rebuilding of the A1s was generally when the boilers expired. The last A1 was rebuilt in 1947 - a testament to the longevity of many of the original A1 boilers. The only A1 not be rebuilt as an A3 was No. 4470 Great Northern, which was rebuilt by Thompson in 1945 as Class A1/1."
)
)